def archiver(text: str, root_dictionary: dict) -> str:
    # проходим по каждой паре корень-идентификатор в словаре корней
    for root, key in root_dictionary.items():
        # заменяем все соответствия корня в тексте на соответствующий идентификатор
        text = text.replace(root, f"${key}")
    # возвращаем архивированный текст
    return text

def unpacker(text: str, root_dictionary: dict) -> str:
    # проходим по каждой паре корень-идентификатор в словаре корней
    for root, key in root_dictionary.items():
        # ищем начало идентификатора в тексте и заменяем его на нужный корень
        text = text.replace(f"${key}", root)
    # возвращаем распакованный текст
    return text

# словарь
russ_dictionary = {
    "дела": "$a",
    "говор": "$б",
    "работа": "$в",
    "жизненн": "$г",
    "челове": "$д",
    "место": "$е",
    "врем": "$ё",
    "денеж": "$ж",
    "недел": "$з",
    "годн": "$и",
    "хорош": "$й",
    "больш": "$к",
    "маленьк": "$л",
    "готов": "$м",
    "сказа": "$н",
    "котор": "$о",
    "смотр": "$п",
    "пере": "$р",
    "земл": "$с",
    "скор": "$т",
    "крас": "$у",
    "важн": "ф",
    "знам": "х",
    "жизн": "$ц",
    "слова": "$ч",
    "добав": "$ш"

}
